<?php

namespace Database\Seeders;

use App\Models\Service;
use Illuminate\Database\Seeder;

class ServicesSeeder extends Seeder
{
  /**
   * Run the database seeds.
   *
   * @return void
   */
  public function run()
  {
    $services = array(
      array(
        'id' => 1,
        'icon' => '<svg viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M17.9998 0H2.00977C0.909766 0 0.00976562 0.9 0.00976562 2V20L3.99977 16H17.9998C19.0998 16 19.9998 15.1 19.9998 14V2C19.9998 0.9 19.0998 0 17.9998 0ZM10.9998 12H8.99977V10H10.9998V12ZM10.9998 7C10.9998 7.55 10.5498 8 9.99977 8C9.44977 8 8.99977 7.55 8.99977 7V5C8.99977 4.45 9.44977 4 9.99977 4C10.5498 4 10.9998 4.45 10.9998 5V7Z" fill="#1D1D1D"/></svg>',
        'title' => 'Консультация',
        'description' => 'Консультация по выбору лучшего решения из продуктов 1С для вашего бизнеса.',
      ),
      array(
        'id' => 2,
        'icon' => '<svg viewBox="0 0 14 20" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M13 5V2C13 0.9 12.1 0 11 0H3C1.9 0 1 0.9 1 2V5H0V11L3 17V20H11V17L14 11V5H13ZM3 2H11V5H9V3H8V5H6V3H5V5H3V2Z" fill="#1D1D1D"/></svg>',
        'title' => 'Установка',
        'description' => 'Установка и тонкая настройка выбранного Вами решения на вашем сервере для вашего удобства.',
      ),
      array(
        'id' => 3,
        'icon' => '<svg viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M15 18H3C2.45 18 2 17.55 2 17V5C2 4.45 1.55 4 1 4C0.45 4 0 4.45 0 5V18C0 19.1 0.9 20 2 20H15C15.55 20 16 19.55 16 19C16 18.45 15.55 18 15 18ZM18 0H6C4.9 0 4 0.9 4 2V14C4 15.1 4.9 16 6 16H18C19.1 16 20 15.1 20 14V2C20 0.9 19.1 0 18 0ZM18 10L15.5 8.5L13 10V2H18V10Z" fill="#1D1D1D"/></svg>',
        'title' => 'Обучение',
        'description' => 'Обучение и поддержка вашего персонала по работе с системой вплоть до адаптации.',
      ),
      array(
        'id' => 4,
        'icon' => '<svg viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M18.5 10H17V6C17 4.9 16.1 4 15 4H11V2.5C11 1.12 9.88 0 8.5 0C7.12 0 6 1.12 6 2.5V4H2C0.9 4 0.00999999 4.9 0.00999999 6V9.8H1.5C2.99 9.8 4.2 11.01 4.2 12.5C4.2 13.99 2.99 15.2 1.5 15.2H0V19C0 20.1 0.9 21 2 21H5.8V19.5C5.8 18.01 7.01 16.8 8.5 16.8C9.99 16.8 11.2 18.01 11.2 19.5V21H15C16.1 21 17 20.1 17 19V15H18.5C19.88 15 21 13.88 21 12.5C21 11.12 19.88 10 18.5 10Z" fill="#1D1D1D"/></svg>',
        'title' => 'Разработка',
        'description' => 'Разработка индивидуального решения под ваши нужды на основе одного из 1С продуктов.',
      ),
      array(
        'id' => 5,
        'icon' => '<svg viewBox="0 0 18 20" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M16 2H11.82C11.4 0.84 10.3 0 9 0C7.7 0 6.6 0.84 6.18 2H2C0.9 2 0 2.9 0 4V18C0 19.1 0.9 20 2 20H16C17.1 20 18 19.1 18 18V4C18 2.9 17.1 2 16 2ZM9 2C9.55 2 10 2.45 10 3C10 3.55 9.55 4 9 4C8.45 4 8 3.55 8 3C8 2.45 8.45 2 9 2ZM10 16H5C4.45 16 4 15.55 4 15C4 14.45 4.45 14 5 14H10C10.55 14 11 14.45 11 15C11 15.55 10.55 16 10 16ZM13 12H5C4.45 12 4 11.55 4 11C4 10.45 4.45 10 5 10H13C13.55 10 14 10.45 14 11C14 11.55 13.55 12 13 12ZM13 8H5C4.45 8 4 7.55 4 7C4 6.45 4.45 6 5 6H13C13.55 6 14 6.45 14 7C14 7.55 13.55 8 13 8Z" fill="#1D1D1D"/></svg>',
        'title' => 'Доработка',
        'description' => 'Доработка и сопровождение вашего имеющегося 1С продукта.',
      ),
      array(
        'id' => 6,
        'icon' => '<svg viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M16 0H2C0.9 0 0 0.9 0 2V16C0 17.1 0.9 18 2 18H16C17.1 18 18 17.1 18 16V2C18 0.9 17.1 0 16 0ZM5 14C4.45 14 4 13.55 4 13V8C4 7.45 4.45 7 5 7C5.55 7 6 7.45 6 8V13C6 13.55 5.55 14 5 14ZM9 14C8.45 14 8 13.55 8 13V5C8 4.45 8.45 4 9 4C9.55 4 10 4.45 10 5V13C10 13.55 9.55 14 9 14ZM13 14C12.45 14 12 13.55 12 13V11C12 10.45 12.45 10 13 10C13.55 10 14 10.45 14 11V13C14 13.55 13.55 14 13 14Z" fill="#1D1D1D"/></svg>',
        'title' => 'Ввод',
        'description' => 'Ввод ваших первичных данных для демонстрации системы.',
      ),
    );
    foreach ($services as $service) {
      $table = new Service();
      $table->icon = $service['icon'];
      $table->title = $service['title'];
      $table->description = $service['description'];
      $table->save();
    }
  }
}
